
#language: ru

@tree

Функциональность: Дымовые тесты

Контекст: 
	
	Дано я подключаю профиль TestClient "Этот клиент"
Сценарий: Открытие формы списка "КурсыВалют" 

	Дано Я открываю основную форму списка регистра сведений "КурсыВалют"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КурсыВалют"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КурсыВалют"

	Дано Я открываю основную форму регистра сведений "КурсыВалют"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КурсыВалют"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МобильныеОтчеты" 

	Дано Я открываю основную форму списка регистра сведений "МобильныеОтчеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МобильныеОтчеты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МобильныеОтчеты"

	Дано Я открываю основную форму регистра сведений "МобильныеОтчеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МобильныеОтчеты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостояниеВходящихПисем" 

	Дано Я открываю основную форму списка регистра сведений "СостояниеВходящихПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостояниеВходящихПисем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостояниеВходящихПисем"

	Дано Я открываю основную форму регистра сведений "СостояниеВходящихПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостояниеВходящихПисем"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостояниеИсходящихПисем" 

	Дано Я открываю основную форму списка регистра сведений "СостояниеИсходящихПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостояниеИсходящихПисем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостояниеИсходящихПисем"

	Дано Я открываю основную форму регистра сведений "СостояниеИсходящихПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостояниеИсходящихПисем"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Характеристики" 

	Дано Я открываю основную форму списка регистра сведений "Характеристики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений Характеристики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Характеристики"

	Дано Я открываю основную форму регистра сведений "Характеристики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений Характеристики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЦеныТоваров" 

	Дано Я открываю основную форму списка регистра сведений "ЦеныТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЦеныТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЦеныТоваров"

	Дано Я открываю основную форму регистра сведений "ЦеныТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЦеныТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Взаиморасчеты" 

	Дано Я открываю основную форму списка регистра накопления "Взаиморасчеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления Взаиморасчеты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Взаиморасчеты"

	Дано Я открываю основную форму регистра накопления "Взаиморасчеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления Взаиморасчеты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Продажи" 

	Дано Я открываю основную форму списка регистра накопления "Продажи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления Продажи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Продажи"

	Дано Я открываю основную форму регистра накопления "Продажи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления Продажи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварныеЗапасы" 

	Дано Я открываю основную форму списка регистра накопления "ТоварныеЗапасы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварныеЗапасы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварныеЗапасы"

	Дано Я открываю основную форму регистра накопления "ТоварныеЗапасы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления ТоварныеЗапасы"
	И Я закрываю текущее окно

